[
{"Link":"https://blockchain.news/news/is-it-wise-for-e-commerce-stores-to-accept-crypto-as-payment","Nguồn":"https://blockchain.news","Tiêu đề":"Is It Wise for E-Commerce Stores to Accept Crypto As Payment?","Chuyên mục":"News","Tác giả":"Zach Anderson","Ngày tạo":"Apr 15, 2024 14:01","Tags":"e-commerce   crypto   payment   ","Nội dung":"Cryptocurrencies are transforming the e-commerce industry, offering global reach, cost savings, safety, and cross-border business opportunities, with potential to reach $2.9 billion by 2030. Everyone is aware of crypto these days. Once obscure, these digital assets are rapidly integrating into the mainstream, particularly in the realm of e-commerce. The industry is predicted to grow from its previous perception as a niche investment for tech enthusiasts to $2.9 billion by 2030. The increasing digitisation of various aspects of life demands the recognition of virtual currency as an authentic asset, not merely a passing fad. This article will examine why the e-commerce industry is open to accept crypto as a viable payment solution, as well as what benefits it presents. The unpredictable adoption rates of cryptocurrencies make it challenging to estimate the size of the market. The Global Crypto Adoption Index indicated that adoption peaked in Q2 2021. However, affected by economic concerns and market instability, cryptocurrency ownership proceeded to witness significant fluctuations. According to stats, adult crypto ownership rates in the United States fell slightly from 33% in 2022 to 30% in 2023. However, with 60% of respondents saying they are familiar with the idea, there appears to be a good chance that the use of digital currencies will rise as technology becomes more widely available. Though, the use of cryptocurrency is still quite low. According to the same survey, 38% of cryptocurrency users were lured to the technology, whereas only 13% of users bought crypto for usage in online transactions. aims to overcome the drawbacks of conventional payment methods to enhance the consumer experience. As the needs for online commerce change, cryptocurrencies present a viable way to conduct transactions more quickly. This and decreasing trust in conventional institutions suggest that future perceptions and usage of cryptocurrencies may change. Using cryptocurrency for gives e-commerce companies a number of advantages over competitors: E-commerce sites can reach a wider audience worldwide with cryptocurrencies. are not always accessible everywhere and may have regional limitations. Companies looking to conduct business often choose to use cryptocurrencies because of their ease of use and absence of global regulation. Businesses can avoid the high fees associated with using credit cards by accepting cryptocurrencies. Customers and businesses may save money as a result of the typically lower fees connected with digital asset transactions, which would cut the price of goods and services. Transactions using cryptocurrencies are highly secure since they are decentralised. As a transaction is almost impossible to undo after completion, the likelihood of fraud is greatly decreased. Adopting blockchain technology provides an extra layer of protection against chargebacks and fraudulent actions, protecting merchants and customers in the online marketplace. With cryptocurrency, a wide range of e-commerce applications are feasible: Loyalty Programmes: The innovative and safe benefits that customers may now enjoy as a result of blockchain technology increase the allure of . Benefits like loyalty tokens are ensured to be fair and secure due to the immutability of blockchain technology, which increases engagement and confidence. Web 3.0 and Metaverse: With its immersive purchasing experience, cryptocurrency is a key component of both Web 3.0 and the metaverse. It enhances user engagement by facilitating transactions for virtual money and collectables. Supply Chain Transparency: Supply chain integrity and product manufacturing can be transparently verified by using blockchain for tracking. This highlights a brand's dedication to integrity in the fight against fake goods and unscrupulous business methods. Specialised Marketplaces: With the emergence of virtual assets, specialised peer-to-peer networks marketplaces have been established. These platforms give merchants new chances to reach larger audiences and increase their market presence by providing safer transactions and lower operating costs. Companies that accept crypto as payment have a unique opportunity to gain a lot from this technology and other innovations in the industry. In addition to the advantages mentioned earlier, using cryptocurrency for payments has enormous potential to grow the e-commerce sector. "},
{"Link":"https://www.forbes.com/sites/digital-assets/2024/04/15/takeaways-from-the-bitcoin-policy-summit-where-dc-met-bitcoin/?ss=FDA&sh=3131937a5495","Nguồn":"https://www.forbes.com","Tiêu đề":"Takeaways From The Bitcoin Policy Summit, Where DC Met Bitcoin","Chuyên mục":"Forbes Forbes Digital Assets","Tác giả":"Roger Huang","Ngày tạo":"Apr 17, 2024,","Tags":"Không có","Nội dung":"A scene from the Bitcoin Policy Summit last year. During the Bitcoin Policy Summit, policymakers from across the U.S. government, including five members of Congress, spoke with industry representatives and the bitcoin community. I attended as a speaker on countering digital authoritarianism, highlighting different parts of the world that were embracing central bank digital currencies, and what role the United States could play in leveraging bitcoin to ensure its use as a tool of freedom and resilience. There were many lessons learned, but a few can make for a powerful summary. Despite the reputation of having Bitcoin as a divisive topic that can fall under the traditional “red vs. blue” debate, we saw two Democratic members of Congress, and three Republicans Members of Congress from a variety of states talk about why they thought Bitcoin benefited the United States. Sens. Cynthia Lummis (R-Wyo.), Kirsten Gillibrand (D-N.Y.) and Marsha Blackburn (R-Tenn., host state of Bitcoin 2024) all brought passionate speeches talking about the value of Bitcoin and how it could benefit their constituents. Lummis in particular brought forward a passionate defense of why bitcoin scared members of the government who tried to control it. On the House side, outgoing House Financial Services Chair Rep. McHenry (R-N.C.) and Rep. Wiley Nickel (D-N.C.) brought forward their views on bitcoin. Executive branch employees from across the different cabinets of the United States also joined in, with representation from the Treasury Department, Energy Department and more. The speakers didn’t talk about the benefits of bitcoin for their political party, but rather how the United States should study and consider leveraging it. This was a rare tone in a political process that might often be more known for partisan-level sniping rather than broad consensus and consideration. Having said that, bitcoin isn’t immune from political maneuvering. Policymakers mentioned that the Financial Services Committee was quite pro-bitcoin, but Senate Banking Committee tended not to be. Yet it was refreshing to hear policymakers talk about bitcoin in a more reflective tone rather than a reactive one shaped by partisan talking points. The Bitcoin Policy Summit drew a full house, with many legislative staffers, policy analysts and policymakers from various parts of the federal government. The seats were packed, and the general attitude was one of curiosity. There was a sense that Bitcoin had grown through another maturation stage. For the policymakers, the ETF approvals were an inflection point, something that gave bitcoin more of a “grown-up” appearance. The full crowd of policy folks at the Bitcoin Policy Summit gave credence to the idea that bitcoin was now no longer just a side topic in Washington, but rather something that could generate a large amount of interest. The entire conference was noticeable for having no panels that directly discussed the price of bitcoin and how to trade it. There wasn’t any “expert” that came in and said this model could perfectly predict bitcoin’s price at this entry point or exit point. While price movement and the consideration of price are important, it felt like the conference was curated and organically resonated around bitcoin’s use as a tool, and it featured several human rights activists, including Anna Chekhovich, who served served as financial director of the Anti-Corruption Foundation founded by Alexei Navalny. I had written previously about bitcoin mining after China’s bitcoin mining ban. The consequences of that were clear during the conference, whose major sponsors were mostly publicly traded miners now based in the United States. The world’s largest mining pool, Foundry Group, is now based in the United States. There are now companies like Riot, Cleanspark and Marathon that contribute significantly to bitcoin’s security and computing power. Bitcoin mining is one of the rare gifts that the Chinese party-state has given the United States. Many miners talked about the employment benefits they provided. For example, Jason Les of Riot discussed the 600 rural jobs that Riot generated, and Fred Thiel, the CEO of Marathon, mentioned a shrimp farm powered by heat from bitcoin mining, converting an economically productive activity to a second-order one. Instead of following the trendline of giving up long-term intellectual capital and skills development for short-term profits (as happened with fields as diverse as solar panel manufacturing and the creation of semiconductor foundries), bitcoin mining offers the opportunity for the United States to capitalise on skills clusters that China forbade on ideological reasons, with the added bonus of further decentralising hash rate dedicated to bitcoin’s security. Members of Generation Bitcoin were among the attendees, as well as the moderators. One of the speakers for example, was Arsh Molu who interviewed Roya Mahboob. He is the founder of Generation Bitcoin, which worked with Bitcoin Magazine to give students free entry to Bitcoin 2024 in Nashville. It was a great demonstration that bitcoin is popular among all age groups, and that young people today are interested in bitcoin. The Bitcoin Policy Summit was an engaging event that brought together bitcoiners and policymakers together into an active discussion. It placed the United States among a number of countries that are considering bitcoin for its benefits, rather than countries like China that have tried to ban it. Given the global leadership role the United States has, the lessons and interactions that came about because of the Summit may very well resonate across the world in time.  "},
{"Link":"https://www.forbes.com/sites/digital-assets/2024/04/15/bitcoin-halving-a-wild-ride/?ss=FDA&sh=1be82ece3776","Nguồn":"https://www.forbes.com","Tiêu đề":"Bitcoin Halving: A Wild Ride","Chuyên mục":"Forbes Forbes Digital Assets","Tác giả":"Clem Chambers","Ngày tạo":"Apr 17, 2024,","Tags":"Không có","Nội dung":"Bitcoin's halving is only days away. Anyone who tells you bitcoin’s volatility is a negative is foolish. Speculators and those folks who have driven the fascination with crypto love volatility. People love to gamble and if you take that away from an asset it becomes a dull backwater. If you are reading this you are unlikely to be a blue chip “widows and orphans” type of investor. While volatility kills it also thrills! So what do you know, bitcoin has thrown a mighty tantrum, for the hundredth time. That is totally predictable, but what isn’t is what happens next. Here I outlined the roadmap and series of charts to help navigate this cycle end rally. Using classic charting used in post war boom markets, we are in a period of equilibrium, typified by this chart from a few days ago: The bitcoin chart a few days ago: a period of equilibrium And here we are: The current bitcoin chart So the call when you hit these “equilibrium” points is: ‘Is it over or is it half way?’ It’s a quirk of probability, but that’s a tried and tested check for me based on random walk maths. So the only call is represented by this chart: The bitcoin chart: will it go sideways or up? So let’s go back to the basic premise of repeating patterns: The bitcoin chart's repeating patterns So I think I do not need to say much more. If this rally is half way, the theoretical top is $100,000 or so. If not it’s back to $40,000. Therefore I’m using the box as guide rails to keep track of the action. The above chart is very compelling to me, but that is no reason to be bitcoin-maxi complacent. A repeating pattern needs a repeating process, and in this ever-changing world we live in patterns can change. For now at least we remain in bounds. We are days away from the halving, but that is no finishing post; in fact, in the past there has been a lag between the cut in new bitcoin production and a rally, so it remains the case that holders need to watch and wait or take their profits and retire off to count them. I generally bail early but to me we still have a final leg to go. This is not fate but an opinion and in these market verticals it is extremely difficult to know when the party is over, but for now the music is still playing and it is time to look for opportunities that could balloon on any last leg move. To me that might be ordinals and runes on the bitcoin chain, so it is time to go skill up on them, because in crypto it is in obscurity that the big returns lay. Disclosure: I own bitcoin, ethereum, ordinals and various crypto of many kinds.  "},
{"Link":"https://blockchain.news/news/israeli-central-bank-official-embraces-cbdc-competition-with-banks-for-economic-growth","Nguồn":"https://blockchain.news","Tiêu đề":"Israeli Central Bank Official Embraces CBDC Competition with Banks for Economic Growth","Chuyên mục":"News","Tác giả":"Luisa Crawford","Ngày tạo":"Apr 17, 2024 10:23","Tags":"bank of israel   cbdc   digital shekel   financial system   ","Nội dung":"In a recent speech, Bank of Israel Deputy Governor Andrew Abir expressed his support for the competition between commercial banks and the forthcoming Central Bank Digital Currency (CBDC) known as the digital shekel. Abir believes that the digital shekel has the potential to enhance competition in the financial system and benefit the economy as a whole. Israeli central bank official, Andrew Abir, sees the introduction of the digital shekel as a catalyst for technological advancements that will drive competition in the banking sector. He acknowledges the ongoing efforts to increase competition in the Israeli banking industry and states that there is still a long way to go. Abir notes that public sentiment towards commercial banks in Israel is not always favorable, and part of the discontent stems from the need to improve competition in certain segments of the industry. The digital shekel, currently in the planning stages, is designed to include an option for paying interest. Abir assures the public that the digital shekel will be developed by the Bank of Israel, a trusted institution that stands behind the traditional cash system. He emphasizes that the digital shekel will not be created by an anonymous entity like Satoshi Nakamoto, the pseudonymous creator of Bitcoin, but rather by a transparent and accountable central bank. Abir highlights the advantages of introducing a digital shekel for the Bank of Israel as well. It would provide the central bank with greater accessibility to central bank money, facilitating its use in digital payments. This would counteract the declining trend in central bank money usage resulting from advancements in the private sector. Additionally, the digital shekel could incentivize commercial banks to offer higher interest rates to customers, as the option to hold digital shekels would increase competition. The digital shekel has garnered strong support among the Israeli public, indicating a positive reception for the potential benefits it offers. The introduction of a CBDC like the digital shekel is seen as a step towards enhancing competition in the financial system, driving innovation, and ultimately benefiting the Israeli economy. As the Bank of Israel continues to develop the digital shekel, it aims to create a trusted and efficient digital currency that aligns with the country's financial goals. With the support of central bank officials like Andrew Abir, the digital shekel has the potential to revolutionize the Israeli banking industry and pave the way for a more competitive and technologically advanced financial system. "},
{"Link":"https://blockchain.news/news/uk-finance-launches-experimental-phase-for-regulated-liability-network","Nguồn":"https://blockchain.news","Tiêu đề":"UK Finance Launches Experimental Phase for Regulated Liability Network (RLN)","Chuyên mục":"News","Tác giả":"Jessie A Ellis","Ngày tạo":"Apr 17, 2024 10:45","Tags":"uk finance   regulated liability network   rln   ","Nội dung":"UK Finance is launching an experimental phase to explore the UK Regulated Liability Network's potential in payment-upon-delivery, homebuying process improvements, and digital bond settlement, aligning with Project Rosalind. UK Finance, a pivotal entity in the banking and finance sector of the United Kingdom, has initiated an experimental phase to delve into the capabilities and benefits of the UK Regulated Liability Network (RLN). This innovative phase involves a strategic partnership with eleven member organizations, aiming to unlock new possibilities in digital transactions and finance management through the RLN. The experiments conducted under this initiative will scrutinize three distinct use cases: payment-upon-delivery for physical products, improvements in the homebuying process, and digital bond settlement. These cases are chosen to address specific challenges in the current financial ecosystem, ranging from online transaction fraud to inefficiencies in property transactions and bond settlements. This use case is designed to combat fraud in online transactions by ensuring that payments are made only when the physical product is successfully delivered. By leveraging the capabilities of the RLN, this approach promises to bolster security and trust in e-commerce, offering a more reliable shopping experience for consumers. Focusing on the real estate sector, this use case aims at enhancing transparency for customers and reducing conveyance fraud, a prevalent issue where deceit is used to evade creditor claims. The RLN's application in this area is expected to provide a secure and transparent platform for property transactions, significantly mitigating risks associated with property dealings. The third use case explores the use of digital money for settling digital bonds. By incorporating the RLN, this initiative seeks to streamline the settlement process, potentially reducing costs and improving operational efficiency in financial markets. The experimental phase of the RLN is closely aligned with Project Rosalind, a collaborative initiative between the Bank for International Settlements and the Bank of England. Project Rosalind is focused on developing an application programming interface (API) for a potential digital pound. The RLN experiments are set to explore foundational capabilities that ensure compatibility and interoperability with future digital currency initiatives, thereby paving the way for more integrated and efficient financial operations. The collaboration between UK Finance and its member organizations through the RLN experiments marks a significant step towards modernizing the financial landscape of the UK. By addressing critical issues through tailored use cases and aligning with broader digital currency projects like Project Rosalind, the initiative not only promises enhanced operational efficiencies but also positions the UK at the forefront of financial innovation. As these experiments unfold, the outcomes are expected to contribute substantially to the shaping of a safer, more transparent, and efficient financial future. "},
{"Link":"https://blockchain.news/news/samsung-secures-64-billion-in-us-government-grants-for-chip-manufacturing-expansion-in-texas","Nguồn":"https://blockchain.news","Tiêu đề":"Samsung Secures $6.4 Billion in US Government Grants for Chip Manufacturing Expansion in Texas","Chuyên mục":"News","Tác giả":"Jessie A Ellis","Ngày tạo":"Apr 16, 2024 03:42","Tags":"samsung   chip   texas   ","Nội dung":"Samsung Electronics has secured $6.4 billion in US government grants to expand its Texas chip manufacturing operations, aiming to boost production for automotive, aerospace, and defense industries, including two production facilities and a research center. Global leader in semiconductor technology Samsung Electronics recently revealed that it has obtained US government funds totaling $6.4 billion to expand its chip manufacturing facilities in Texas. The United States' ability to produce chips domestically will be greatly enhanced by this huge investment, especially in sectors like aerospace, defence, and automotive. The 2022 Chips and Science Act, a piece of legislation signed into law by President Joe Biden, provides the financing for this expansion. The act's goal is to improve and revive the country's output of cutting-edge computer chips. It is anticipated that the government assistance and private investments would total more than $40 billion, which will significantly strengthen the semiconductor sector. By establishing a cutting-edge semiconductor ecosystem in Texas, the planned initiative would lead the state to the forefront of chip production. Two production facilities that can produce two- and four-nanometer chips, which are essential for cutting-edge technological applications, are part of the expansion plans. A specific research and development facility will also be built in order to promote creativity and technical breakthroughs in the semiconductor industry. A packaging factory that assembles and packages chip components is another component of the project. It is anticipated that the first manufacturing plant will open in 2026, and the second facility will open in 2027. Additionally, the funding will help Samsung expand its current semiconductor production plant in Austin, Texas, strengthening the company's position in the area. The project is expected to significantly strengthen the local economy by generating over 4,500 manufacturing employment and around 17,000 construction jobs. By increasing its capacity for chip production, Samsung will help achieve the target of having 20% of the world's cutting-edge chips made in the US by the end of the decade. Critical sectors including automotive, aerospace, and defence are seeing a surge in demand for sophisticated chips, which will be met in part by the expanded manufacturing capacity. Additionally, by allowing Samsung to produce semiconductors directly for the Defence Department and lowering dependency on outside suppliers, the expansion will strengthen national security in the United States. "}
]